Autodesk.Revit.DB.WidthMeasuredAt
The allowed values for the WALL_TYPE_WIDTH_MEASURED_AT parameter.

Autodesk.Revit.DB.WidthMeasuredAt.Bottom
The bottom of the wall taking into the base offset before any attachment.

Autodesk.Revit.DB.WidthMeasuredAt.Base
The base constraint of the wall.

Autodesk.Revit.DB.WidthMeasuredAt.Top
The top of the wall taking into account the top offset before any attachment.